КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_УИДыГИС/КонтурЛогистика_УИДыГИС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_УИДыГИС</name>
  <comment>Хранит пул доступных для использования УИДов минтранса</comment>
  <resources>
    <name>Использован</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>ДатаОперации</name>
    <comment>Дата операции добавления / использования</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УИД</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_СтатусыТитулов/КонтурЛогистика_СтатусыТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_СтатусыТитулов</name>
  <comment>Время по МСК!</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыТитулов</types>
    </type>
  </resources>
  <resources>
    <name>СтатусПодписи</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыПодписи</types>
    </type>
  </resources>
  <resources>
    <name>ТипОшибки</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыОшибокСтатусаТитула</types>
    </type>
  </resources>
  <resources>
    <name>КодОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоОшибок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь1С</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГП</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2_5_02</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГО</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ДФ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭкспедиторскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул7</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул6</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул8</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СкладскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулПВ</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул6</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_УИДыГИС/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ОсталосьСвободныхУИДов(Организация) Экспорт
	
	ПериодАктуальностиУИД = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ПериодАктуальностиУИД");
	
	МассивОрганизаций = Новый Массив;
	МассивОрганизаций.Добавить(Справочники.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка());
	
	Если ЗначениеЗаполнено(Организация) Тогда
		МассивОрганизаций.Добавить(Организация);		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КОЛИЧЕСТВО(КонтурЛогистика_УИДыГИС.УИД) КАК Остаток
	               |ИЗ
	               |	РегистрСведений.КонтурЛогистика_УИДыГИС КАК КонтурЛогистика_УИДыГИС
	               |ГДЕ
	               |	НЕ КонтурЛогистика_УИДыГИС.Использован
	               |	И КонтурЛогистика_УИДыГИС.Организация В(&МассивОрганизаций)
	               |	И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(КонтурЛогистика_УИДыГИС.ДатаОперации, МЕСЯЦ, &ПериодАктуальностиУИД), ДЕНЬ) >= КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ)";
	
	Запрос.УстановитьПараметр("МассивОрганизаций", МассивОрганизаций);
	Запрос.УстановитьПараметр("ПериодАктуальностиУИД", ПериодАктуальностиУИД);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		ОстатокУИДов = Выборка.Остаток;
	Иначе
		ОстатокУИДов = 0;
	КонецЕсли;
	
	Возврат ОстатокУИДов;
	
КонецФункции

// Проверяет, что УИД не задан: пустая строка или нулевой GUID.
//
// Параметры:
//  УИД - Строка - идентификатор ГИС.
//
// Возвращаемое значение:
//  Булево - Истина, если УИД считается пустым.
//
Функция ЭтоПустойУИД(УИД) Экспорт
	
	Возврат Не ЗначениеЗаполнено(УИД)
		Или УИД = ПустойУИД();
	
КонецФункции

// Возвращает нулевой GUID для черновиков ПЛ (УИД ещё не взят из пула).
//
// Возвращаемое значение:
//  Строка - "00000000-0000-0000-0000-000000000000".
//
Функция ПустойУИД() Экспорт
	
	Возврат "00000000-0000-0000-0000-000000000000";
	
КонецФункции

Функция УИДИстек(УИД, Организация = Неопределено) Экспорт
	
	Если ЭтоПустойУИД(УИД) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ПериодАктуальностиУИД = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ПериодАктуальностиУИД");
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	КонтурЛогистика_УИДыГИС.ДатаОперации КАК ДатаОперации
	               |ИЗ
	               |	РегистрСведений.КонтурЛогистика_УИДыГИС КАК КонтурЛогистика_УИДыГИС
	               |ГДЕ
	               |	КонтурЛогистика_УИДыГИС.УИД = &УИД
	               |УПОРЯДОЧИТЬ ПО
	               |	КонтурЛогистика_УИДыГИС.ДатаОперации УБЫВ";
	
	Запрос.УстановитьПараметр("УИД", УИД);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ДатаИстечения = КонецДня(ДобавитьМесяц(Выборка.ДатаОперации, ПериодАктуальностиУИД));
	Возврат ДатаИстечения < КонецДня(ТекущаяДатаСеанса());
	
КонецФункции

Функция ПолучитьОчередной(Организация = Неопределено) Экспорт
	
	ПериодАктуальностиУИД = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ПериодАктуальностиУИД");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтурЛогистика_УИДыГИС.УИД КАК УИД,
		|	КонтурЛогистика_УИДыГИС.Организация КАК Организация
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_УИДыГИС КАК КонтурЛогистика_УИДыГИС
		|ГДЕ
		|	НЕ КонтурЛогистика_УИДыГИС.Использован
		|	И КонтурЛогистика_УИДыГИС.Организация = ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_ОрганизацииДиадок.ПустаяСсылка)
		|	И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(КонтурЛогистика_УИДыГИС.ДатаОперации, МЕСЯЦ, &ПериодАктуальностиУИД), ДЕНЬ) >= КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	КонтурЛогистика_УИДыГИС.УИД,
		|	КонтурЛогистика_УИДыГИС.Организация
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_УИДыГИС КАК КонтурЛогистика_УИДыГИС
		|ГДЕ
		|	НЕ КонтурЛогистика_УИДыГИС.Использован
		|	И КонтурЛогистика_УИДыГИС.Организация = &Организация
		|	И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(КонтурЛогистика_УИДыГИС.ДатаОперации, МЕСЯЦ, &ПериодАктуальностиУИД), ДЕНЬ) >= КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Организация";
	
	Запрос.УстановитьПараметр("ПериодАктуальностиУИД", ПериодАктуальностиУИД);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Организация = Выборка.Организация;
		Возврат Выборка.УИД;
		
	Иначе
		
		ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(Организация);
		
		Если ПараметрыСервиса.АвторизацияВыполнена Тогда
			
			ЭтоТестовыйСервер = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ИспользоватьТестовыйСерверДиадок");
			
			Если ЭтоТестовыйСервер = Истина Тогда
				
				РазмерПулаПолученияУИДМинтранса = 1;
				
			Иначе
				
				Попытка
					РазмерПулаПолученияУИДМинтранса = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки(
						"РазмерПулаПолученияУИДМинтранса");
				Исключение
					РазмерПулаПолученияУИДМинтранса = 100;
				КонецПопытки;
				
			КонецЕсли;
			
			УИДыИзПула = ПолучитьМассивУИДовИзПулаМинтранса(РазмерПулаПолученияУИДМинтранса, Организация, ПараметрыСервиса);
			
			Если УИДыИзПула.Количество() Тогда
				ЗагрузитьМассивУИДов(УИДыИзПула, Организация);
				
				Возврат ПолучитьУИДИзЭлементаПула(УИДыИзПула[0]);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ОтметитьИспользованным(УИД, Организация) Экспорт
	
	УдачноОтмечен = Ложь;
	
	МенЗап = СоздатьМенеджерЗаписи();
	МенЗап.УИД = УИД;
	МенЗап.Организация = Организация;
	МенЗап.Прочитать();
	
	Если МенЗап.Использован Тогда 
		УдачноОтмечен = Ложь;
	Иначе
		МенЗап.Использован = Истина;
		МенЗап.Записать(Истина);
		УдачноОтмечен = Истина;
	КонецЕсли;
	
	Возврат УдачноОтмечен;
	
КонецФункции

Функция ЗагрузитьПулУИДовЧерезAPI(КоличествоУИДов, Организация) Экспорт
	
	КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(
		"Начал получение УИДов из пула в количестве " + КоличествоУИДов + " шт.");
	
	Массив = ПолучитьМассивУИДовИзПулаМинтранса(КоличествоУИДов, Организация);
	
	Если Массив.Количество() Тогда
		ЗагрузитьМассивУИДов(Массив, Организация);
		
		КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СообщитьХодВыполнения(
			"Загрузил УИДы в регистр ""УИДы ГИС Минтранса (Контур.Логистика)"" в количестве " + Массив.Количество() + " шт.");
		
	Иначе
		Сообщить("Не смог получить УИДы из пула Минтранса.");
		
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьМассивУИДовИзПулаМинтранса(КоличествоУИДов, Организация, ПараметрыСервиса = Неопределено) Экспорт
	
	Если ПараметрыСервиса = Неопределено Тогда
		ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(Организация);
	КонецЕсли;
	
	Если Не ПараметрыСервиса.АвторизацияВыполнена Тогда
		ВызватьИсключение "Ни у одной из наших организаций не заполнена авторизация в Логистике";
	КонецЕсли;
	
	МассивУИДов = Новый Массив;
	
	boxId = Неопределено;
	Если ЗначениеЗаполнено(Организация) Тогда
		boxId = Организация.ID;
	КонецЕсли;
	
	МассивУИДов = Новый Массив;
	
	Попытка
		МассивУИДов = ПолучитьВыданныеНеиспользованныеУИДыИзПулаМинтранса(ПараметрыСервиса, КоличествоУИДов, boxId, Организация);
	Исключение
		МассивУИДов = Новый Массив;
	КонецПопытки;
	
	Если МассивУИДов.Количество() = 0 Тогда
		МассивУИДов = ПолучитьНовыеУИДыИзПулаМинтранса(ПараметрыСервиса, КоличествоУИДов, boxId);
	КонецЕсли;
	
	Возврат МассивУИДов;

КонецФункции

Функция ПолучитьВыданныеНеиспользованныеУИДыИзПулаМинтранса(ПараметрыСервиса, КоличествоУИДов, boxId, Организация = Неопределено)
	
	Результат = Новый Массив;
	МаксимальнаяПорция = 1000;
	Пропустить = 0;
	
	Пока Истина Цикл
		
		ОтветAPI = КонтурЛогистика_API_Логистика.ПолучитьВыданныеУИДыИзПулаМинтранса(
			ПараметрыСервиса, Пропустить, МаксимальнаяПорция, boxId);
		
		МассивУИДовИзОтвета = ПреобразоватьОтветВыданныхУИДов(ОтветAPI);
		Если МассивУИДовИзОтвета.Количество() = 0 Тогда
			Прервать;
		КонецЕсли;
		
		Результат = ОтфильтроватьИспользованныеУИДыПоОрганизации(МассивУИДовИзОтвета, Организация);
		Если Результат.Количество() > 0 Тогда
			Возврат Результат;
		КонецЕсли;
		
		Пропустить = Пропустить + МассивУИДовИзОтвета.Количество();
		
		// Защита от бесконечного цикла.
		Если Пропустить >= 1000000 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПреобразоватьОтветВыданныхУИДов(ОтветAPI)
	
	Результат = Новый Массив;
	Если ОтветAPI = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	uuidInfos = ОтветAPI.Получить("uuidInfos");
	Если uuidInfos = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого ЭлементУИД Из uuidInfos Цикл
		
		УИД = Неопределено;
		Если ЭлементУИД <> Неопределено Тогда
			uuid = ЭлементУИД.Получить("uuid");
			Если uuid <> Неопределено Тогда
				УИД = uuid;
			КонецЕсли;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(УИД) Тогда
			Продолжить;
		КонецЕсли;
		
		ДатаОперации = КонтурЛогистика_ОбщегоНазначенияСервер.ТекущийМоментВремениМСК();
		issuedAt = ЭлементУИД.Получить("issuedAt");
		Если ЗначениеЗаполнено(issuedAt) Тогда
			Попытка
				ДатаОперации = КонтурЛогистика_СтдJSONКлиентСервер.ПрочитатьДатуJSONЛок(Строка(issuedAt));
			Исключение
				ДатаОперации = КонтурЛогистика_ОбщегоНазначенияСервер.ТекущийМоментВремениМСК();
			КонецПопытки;
		КонецЕсли;
		
		// Договорились с ядром, что не будем брать УИДы, у которых время жизни меньше 30 минут
		КоличествоМинутСДатыВыдачи = (КонтурЛогистика_ОбщегоНазначенияСервер.ТекущийМоментВремениМСК() - ДатаОперации) / 60;
		Если КоличествоМинутСДатыВыдачи < 30 Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Добавить(Новый Структура("УИД, ДатаОперации", УИД, ДатаОперации));
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОтфильтроватьИспользованныеУИДыПоОрганизации(МассивУИДов, Организация)
	
	Если Не ЗначениеЗаполнено(Организация) Тогда
		Возврат МассивУИДов;
	КонецЕсли;
	
	Результат = Новый Массив;
	МассивУИДовСтроками = МассивУИДовДляЗапроса(МассивУИДов);
	ИспользованныеУИДы = ПолучитьИспользованныеУИДыОрганизации(МассивУИДовСтроками, Организация);
	
	Для Каждого ЭлементУИД Из МассивУИДов Цикл
		УИД = ПолучитьУИДИзЭлементаПула(ЭлементУИД);
		Если ИспользованныеУИДы.Получить(УИД) = Истина Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Добавить(ЭлементУИД);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьИспользованныеУИДыОрганизации(МассивУИДовСтроками, Организация)
	
	Результат = Новый Соответствие;
	Если МассивУИДовСтроками.Количество() = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтурЛогистика_УИДыГИС.УИД КАК УИД,
	               |	КонтурЛогистика_УИДыГИС.Использован КАК Использован
	               |ИЗ
	               |	РегистрСведений.КонтурЛогистика_УИДыГИС КАК КонтурЛогистика_УИДыГИС
	               |ГДЕ
	               |	КонтурЛогистика_УИДыГИС.УИД В(&МассивУИДов)
	               |	И КонтурЛогистика_УИДыГИС.Организация = &Организация";
	
	Запрос.УстановитьПараметр("МассивУИДов", МассивУИДовСтроками);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.УИД, Выборка.Использован);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьНовыеУИДыИзПулаМинтранса(ПараметрыСервиса, КоличествоУИДов, boxId)
	
	Результат = Новый Массив;
	МассивНовыхУИДов = КонтурЛогистика_API_Логистика.ПолучитьУИДыИзПулаМинтранса(ПараметрыСервиса, КоличествоУИДов, boxId);
	Если МассивНовыхУИДов = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Для Каждого УИД Из МассивНовыхУИДов Цикл
		Если ЗначениеЗаполнено(УИД) Тогда
			Результат.Добавить(Новый Структура("УИД, ДатаОперации", УИД, ТекущаяДатаСеанса()));
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьУИДИзЭлементаПула(ЭлементПула)
	
	Если ТипЗнч(ЭлементПула) = Тип("Структура") Тогда
		Если ЭлементПула.Свойство("УИД") Тогда
			Возврат ЭлементПула.УИД;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЭлементПула;
	
КонецФункции

// Создает или обновляет записи регистра сведений для массива УИДов в разрезе организации.
//
// Параметры:
//   МассивУИДов - Массив из Строка - массив идентификаторов для обработки
//   Организация - СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок - организация, в разрезе которой ведется учет
Процедура ЗагрузитьМассивУИДов(МассивУИДов, Организация) Экспорт
	
	Если НЕ ПроверитьВходныеПараметры(МассивУИДов, Организация) Тогда
		Возврат;
	КонецЕсли;
	
	СуществующиеЗаписи = ПолучитьСуществующиеЗаписи(МассивУИДов);
	НаборыЗаписей = СформироватьНаборыЗаписей(МассивУИДов, Организация, СуществующиеЗаписи);
	ЗаписатьНаборы(НаборыЗаписей);
	
КонецПроцедуры

Функция ПроверитьВходныеПараметры(МассивУИДов, Организация)
	
	Если МассивУИДов = Неопределено Или МассивУИДов.Количество() = 0 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат ЗначениеЗаполнено(Организация);
	
КонецФункции

Функция ПолучитьСуществующиеЗаписи(МассивУИДов)
	
	МассивУИДовСтроками = МассивУИДовДляЗапроса(МассивУИДов);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УИД КАК УИД,
		|	Организация КАК Организация
		|ИЗ
		|	РегистрСведений.КонтурЛогистика_УИДыГИС
		|ГДЕ
		|	УИД В (&МассивУИДов)";
	Запрос.УстановитьПараметр("МассивУИДов", МассивУИДовСтроками);
	
	Результат = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Результат.Вставить(Выборка.УИД, Выборка.Организация);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция МассивУИДовДляЗапроса(МассивУИДов)
	
	Результат = Новый Массив;
	
	Для Каждого ЭлементПула Из МассивУИДов Цикл
		УИД = ПолучитьУИДИзЭлементаПула(ЭлементПула);
		Если ЗначениеЗаполнено(УИД) Тогда
			Результат.Добавить(УИД);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьНаборыЗаписей(МассивУИДов, НоваяОрганизация, СуществующиеЗаписи)
	
	УИДыКУдалению = Новый Соответствие;
	УИДыКДобавлению = Новый Соответствие;
	
	Для Каждого ЭлементУИД Из МассивУИДов Цикл
		
		УИД = ПолучитьУИДИзЭлементаПула(ЭлементУИД);
		Если Не ЗначениеЗаполнено(УИД) Тогда
			Продолжить;
		КонецЕсли;
		
		СтараяОрганизация = СуществующиеЗаписи.Получить(УИД);
		
		Если СтараяОрганизация = Неопределено Тогда
			// УИД новый - нужно добавить в новую организацию
			ДобавитьУИДВМассивПоОрганизации(УИДыКДобавлению, НоваяОрганизация, ЭлементУИД);
			
		ИначеЕсли СтараяОрганизация <> НоваяОрганизация Тогда
			// УИД меняет организацию - удалить из старой, добавить в новую
			ДобавитьУИДВМассивПоОрганизации(УИДыКУдалению, СтараяОрганизация, УИД);
			ДобавитьУИДВМассивПоОрганизации(УИДыКДобавлению, НоваяОрганизация, ЭлементУИД);
			
		Иначе
			// УИД уже в нужной организации - обновляем Использован
			ДобавитьУИДВМассивПоОрганизации(УИДыКДобавлению, НоваяОрганизация, ЭлементУИД);
		КонецЕсли;
		
	КонецЦикла;
	
	НаборыЗаписей = Новый Соответствие;
	
	Для Каждого Элемент Из УИДыКУдалению Цикл
		
		Организация = Элемент.Ключ;
		МассивУИДовОрганизации = Элемент.Значение;
		
		НаборЗаписей = ПолучитьИлиСоздатьНаборЗаписей(НаборыЗаписей, Организация);
		
		Для Каждого УИД Из МассивУИДовОрганизации Цикл
			УдалитьЗаписьИзНабора(НаборЗаписей, УИД);
		КонецЦикла;
		
	КонецЦикла;
	
	Для Каждого Элемент Из УИДыКДобавлению Цикл
		
		Организация = Элемент.Ключ;
		МассивУИДовОрганизации = Элемент.Значение;
		
		НаборЗаписей = ПолучитьИлиСоздатьНаборЗаписей(НаборыЗаписей, Организация);
		
		Для Каждого ЭлементУИД Из МассивУИДовОрганизации Цикл
			ОбработатьУИДВНаборе(НаборЗаписей, ЭлементУИД);
		КонецЦикла;
		
	КонецЦикла;
	
	Возврат НаборыЗаписей;
	
КонецФункции

Процедура ДобавитьУИДВМассивПоОрганизации(УИДыПоОрганизациям, Организация, УИД)
	
	МассивУИДовОрганизации = УИДыПоОрганизациям.Получить(Организация);
	Если МассивУИДовОрганизации = Неопределено Тогда
		МассивУИДовОрганизации = Новый Массив;
		УИДыПоОрганизациям.Вставить(Организация, МассивУИДовОрганизации);
	КонецЕсли;
	МассивУИДовОрганизации.Добавить(УИД);
	
КонецПроцедуры

Функция ПолучитьИлиСоздатьНаборЗаписей(НаборыЗаписей, Организация)
	
	НаборЗаписей = НаборыЗаписей.Получить(Организация);
	
	Если НаборЗаписей = Неопределено Тогда
		НаборЗаписей = РегистрыСведений.КонтурЛогистика_УИДыГИС.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Организация.Установить(Организация);
		НаборЗаписей.Прочитать();
		НаборыЗаписей.Вставить(Организация, НаборЗаписей);
	КонецЕсли;
	
	Возврат НаборЗаписей;
	
КонецФункции

Процедура УдалитьЗаписьИзНабора(НаборЗаписей, УИД)
	
	ИндексУдаления = -1;
	Для Индекс = 0 По НаборЗаписей.Количество() - 1 Цикл
		Если НаборЗаписей[Индекс].УИД = УИД Тогда
			ИндексУдаления = Индекс;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ИндексУдаления >= 0 Тогда
		НаборЗаписей.Удалить(ИндексУдаления);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработатьУИДВНаборе(НаборЗаписей, ЭлементУИД)
	
	УИД = ПолучитьУИДИзЭлементаПула(ЭлементУИД);
	Если Не ЗначениеЗаполнено(УИД) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаОперации = ТекущаяДатаСеанса();
	Если ТипЗнч(ЭлементУИД) = Тип("Структура")
		И ЭлементУИД.Свойство("ДатаОперации")
		И ЗначениеЗаполнено(ЭлементУИД.ДатаОперации) Тогда
		ДатаОперации = ЭлементУИД.ДатаОперации;
	КонецЕсли;
	
	Для Каждого Запись Из НаборЗаписей Цикл
		Если Запись.УИД = УИД Тогда
			Запись.Использован = Ложь;
			Запись.ДатаОперации = ДатаОперации;
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
	НоваяЗапись = НаборЗаписей.Добавить();
	НоваяЗапись.УИД = УИД;
	НоваяЗапись.Организация = НаборЗаписей.Отбор.Организация.Значение;
	НоваяЗапись.ДатаОперации = ДатаОперации;
	
КонецПроцедуры

Процедура ЗаписатьНаборы(НаборыЗаписей)
	
	Для Каждого КлючИЗначение Из НаборыЗаписей Цикл
		КлючИЗначение.Значение.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры

Процедура ОчиститьПросроченныеИспользованныеУИДы() Экспорт
	
	КоличествоДнейВЧерновике = 7;
	ДокументыКОчистке = ПолучитьДокументыДляОчисткиУИДСтарыхЧерновиков(КоличествоДнейВЧерновике);
	Если ДокументыКОчистке.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	УИДыКОсвобождению = ОчиститьУИДыВДокументахИПолучитьУИДыКОсвобождению(ДокументыКОчистке, КоличествоДнейВЧерновике);
	ОсвободитьУИДыВРегистре(УИДыКОсвобождению);
	
КонецПроцедуры

Функция ОчиститьУИДыВДокументахИПолучитьУИДыКОсвобождению(ДокументыКОчистке, КоличествоДнейВЧерновике)
	
	УИДыКОсвобождению = Новый ТаблицаЗначений;
	УИДыКОсвобождению.Колонки.Добавить("УИД", Новый ОписаниеТипов("Строка"));
	УИДыКОсвобождению.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.КонтурЛогистика_ОрганизацииДиадок"));
	УжеДобавленныеКлючи = Новый Соответствие;
	
	Для Каждого СтрокаДокумента Из ДокументыКОчистке Цикл
		
		Попытка
			ОбъектДокумента = СтрокаДокумента.Ссылка.ПолучитьОбъект();
			ОбъектДокумента[СтрокаДокумента.ИмяРеквизитаУИД] = "";
			ОбъектДокумента.ОбменДанными.Загрузка = Истина;
			ОбъектДокумента.Записать(РежимЗаписиДокумента.Запись);
			
			КлючУникальности = СтрокаДокумента.УИД + XMLСтрока(СтрокаДокумента.Организация);
			Если УжеДобавленныеКлючи.Получить(КлючУникальности) = Неопределено Тогда
				УжеДобавленныеКлючи.Вставить(КлючУникальности, Истина);
				НоваяСтрока = УИДыКОсвобождению.Добавить();
				НоваяСтрока.УИД = СтрокаДокумента.УИД;
				НоваяСтрока.Организация = СтрокаДокумента.Организация;
			КонецЕсли;
		Исключение
			ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
			ТекстОшибки = "Не удалось очистить УИД в документе в статусе черновик дольше "
				+ Строка(КоличествоДнейВЧерновике) + " дн. " + Строка(СтрокаДокумента.Ссылка)
				+ ". Причина: " + ОписаниеОшибки();
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		КонецПопытки;
		
	КонецЦикла;
	
	Возврат УИДыКОсвобождению;
	
КонецФункции

Функция ПолучитьДокументыДляОчисткиУИДСтарыхЧерновиков(КоличествоДнейВЧерновике)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КонтурЛогистика_ЗЗ_Титул1.Ссылка КАК Ссылка,
		|	""УИД_Зак"" КАК ИмяРеквизитаУИД,
		|	КонтурЛогистика_ЗЗ_Титул1.УИД_Зак КАК УИД,
		|	КонтурЛогистика_УИДыГИС.Организация КАК Организация
		|ИЗ
		|	Документ.КонтурЛогистика_ЗЗ_Титул1 КАК КонтурЛогистика_ЗЗ_Титул1
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
		|		РегистрСведений.КонтурЛогистика_СтатусыТитулов.СрезПоследних(&ТекущаяДата, ) КАК СтатусыТитулов
		|		ПО (КонтурЛогистика_ЗЗ_Титул1.Ссылка = (ВЫРАЗИТЬ(СтатусыТитулов.Документ КАК Документ.КонтурЛогистика_ЗЗ_Титул1)))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_УИДыГИС КАК КонтурЛогистика_УИДыГИС
		|		ПО КонтурЛогистика_ЗЗ_Титул1.УИД_Зак = КонтурЛогистика_УИДыГИС.УИД
		|ГДЕ
		|	СтатусыТитулов.Статус = &СтатусЧерновик
		|	И КонтурЛогистика_УИДыГИС.Использован
		|	И КОНЕЦПЕРИОДА(
		|		ДОБАВИТЬКДАТЕ(
		|			ВЫБОР КОГДА КонтурЛогистика_ЗЗ_Титул1.Дата > КонтурЛогистика_ЗЗ_Титул1.ДатаЗак 
		|				ТОГДА КонтурЛогистика_ЗЗ_Титул1.Дата 
		|				ИНАЧЕ КонтурЛогистика_ЗЗ_Титул1.ДатаЗак 
		|			КОНЕЦ, ДЕНЬ, &КоличествоДнейВЧерновике), ДЕНЬ) < КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КонтурЛогистика_ТрН_Титул1.ДокументЭТРН.Ссылка,
		|	""УИД"",
		|	КонтурЛогистика_ТрН_Титул1.ДокументЭТРН.УИД,
		|	КонтурЛогистика_УИДыГИС.Организация
		|ИЗ
		|	Документ.КонтурЛогистика_ТрН_Титул1 КАК КонтурЛогистика_ТрН_Титул1
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
		|		РегистрСведений.КонтурЛогистика_СтатусыТитулов.СрезПоследних(&ТекущаяДата, ) КАК СтатусыТитулов
		|		ПО (КонтурЛогистика_ТрН_Титул1.Ссылка = (ВЫРАЗИТЬ(СтатусыТитулов.Документ КАК Документ.КонтурЛогистика_ТрН_Титул1)))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_УИДыГИС КАК КонтурЛогистика_УИДыГИС
		|		ПО КонтурЛогистика_ТрН_Титул1.ДокументЭТРН.УИД = КонтурЛогистика_УИДыГИС.УИД
		|ГДЕ
		|	СтатусыТитулов.Статус = &СтатусЧерновик
		|	И КонтурЛогистика_УИДыГИС.Использован
		|	И КОНЕЦПЕРИОДА(
		|		ДОБАВИТЬКДАТЕ(
		|			ВЫБОР 
		|				КОГДА КонтурЛогистика_ТрН_Титул1.Дата > КонтурЛогистика_ТрН_Титул1.ДокументЭТРН.Дата 
		|					И КонтурЛогистика_ТрН_Титул1.Дата > КонтурЛогистика_ТрН_Титул1.ДокументЭТРН.ДатаТрн 
		|					ТОГДА КонтурЛогистика_ТрН_Титул1.Дата 
		|				КОГДА КонтурЛогистика_ТрН_Титул1.ДокументЭТРН.Дата > КонтурЛогистика_ТрН_Титул1.ДокументЭТРН.ДатаТрн 
		|					ТОГДА КонтурЛогистика_ТрН_Титул1.ДокументЭТРН.Дата 
		|				ИНАЧЕ КонтурЛогистика_ТрН_Титул1.ДокументЭТРН.ДатаТрн 
		|			КОНЕЦ, ДЕНЬ, &КоличествоДнейВЧерновике), ДЕНЬ) < КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ)
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	КонтурЛогистика_ЗН_Титул1.Ссылка,
		|	""УИД_ЗН"",
		|	КонтурЛогистика_ЗН_Титул1.УИД_ЗН,
		|	КонтурЛогистика_УИДыГИС.Организация
		|ИЗ
		|	Документ.КонтурЛогистика_ЗН_Титул1 КАК КонтурЛогистика_ЗН_Титул1
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ 
		|		РегистрСведений.КонтурЛогистика_СтатусыТитулов.СрезПоследних(&ТекущаяДата, ) КАК СтатусыТитулов
		|		ПО (КонтурЛогистика_ЗН_Титул1.Ссылка = (ВЫРАЗИТЬ(СтатусыТитулов.Документ КАК Документ.КонтурЛогистика_ЗН_Титул1)))
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_УИДыГИС КАК КонтурЛогистика_УИДыГИС
		|		ПО КонтурЛогистика_ЗН_Титул1.УИД_ЗН = КонтурЛогистика_УИДыГИС.УИД
		|ГДЕ
		|	СтатусыТитулов.Статус = &СтатусЧерновик
		|	И КонтурЛогистика_УИДыГИС.Использован
		|	И КОНЕЦПЕРИОДА(ДОБАВИТЬКДАТЕ(КонтурЛогистика_ЗН_Титул1.Дата, ДЕНЬ, &КоличествоДнейВЧерновике), ДЕНЬ) < КОНЕЦПЕРИОДА(&ТекущаяДата, ДЕНЬ)";
	
	// ПЛ 5.01 / 5.02 исключены: черновики пишут нулевой УИД, реальный берётся при подписании.
	Запрос.УстановитьПараметр("КоличествоДнейВЧерновике", КоличествоДнейВЧерновике);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("СтатусЧерновик", Перечисления.КонтурЛогистика_СтатусыТитулов.Черновик);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции


Процедура ОсвободитьУИДыВРегистре(УИДыКОсвобождению)
	
	Для Каждого СтрокаУИД Из УИДыКОсвобождению Цикл
		
		Попытка
			МенеджерЗаписи = СоздатьМенеджерЗаписи();
			МенеджерЗаписи.УИД = СтрокаУИД.УИД;
			МенеджерЗаписи.Организация = СтрокаУИД.Организация;
			МенеджерЗаписи.Прочитать();
			
			Если Не МенеджерЗаписи.Использован Тогда
				Продолжить;
			КонецЕсли;
			
			МенеджерЗаписи.Использован = Ложь;
			МенеджерЗаписи.Записать(Истина);
		Исключение
			ИмяСобытия = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИмяСобытияЖурналаРегистрации();
			ТекстОшибки = "Не удалось освободить УИД в регистре (сбросить Использован). УИД: "
				+ Строка(СтрокаУИД.УИД) + ". Причина: " + ОписаниеОшибки();
			ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецЕсли
